espressif/esp-idf/components/soc/esp32s31/register/soc/ppa_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** PPA_BLEND0_CLUT_DATA_REG register
 *  CLUT sram data read/write register in background plane of blender
 */
#define PPA_BLEND0_CLUT_DATA_REG (DR_REG_PPA_BASE + 0x0)
/** PPA_RDWR_WORD_BLEND0_CLUT : R/W; bitpos: [31:0]; default: 0;
 *  Write and read data to/from CLUT RAM in background plane of blender engine through
 *  this field in fifo mode.
 */
#define PPA_RDWR_WORD_BLEND0_CLUT    0xFFFFFFFFU
#define PPA_RDWR_WORD_BLEND0_CLUT_M  (PPA_RDWR_WORD_BLEND0_CLUT_V << PPA_RDWR_WORD_BLEND0_CLUT_S)
#define PPA_RDWR_WORD_BLEND0_CLUT_V  0xFFFFFFFFU
#define PPA_RDWR_WORD_BLEND0_CLUT_S  0

/** PPA_BLEND1_CLUT_DATA_REG register
 *  CLUT sram data read/write register in foreground plane of blender
 */
#define PPA_BLEND1_CLUT_DATA_REG (DR_REG_PPA_BASE + 0x4)
/** PPA_RDWR_WORD_BLEND1_CLUT : R/W; bitpos: [31:0]; default: 0;
 *  Write and read data to/from CLUT RAM in foreground plane of blender engine through
 *  this field in fifo mode.
 */
#define PPA_RDWR_WORD_BLEND1_CLUT    0xFFFFFFFFU
#define PPA_RDWR_WORD_BLEND1_CLUT_M  (PPA_RDWR_WORD_BLEND1_CLUT_V << PPA_RDWR_WORD_BLEND1_CLUT_S)
#define PPA_RDWR_WORD_BLEND1_CLUT_V  0xFFFFFFFFU
#define PPA_RDWR_WORD_BLEND1_CLUT_S  0

/** PPA_CLUT_CONF_REG register
 *  CLUT configure register
 */
#define PPA_CLUT_CONF_REG (DR_REG_PPA_BASE + 0xc)
/** PPA_APB_FIFO_MASK : R/W; bitpos: [0]; default: 0;
 *  1'b0: fifo mode to wr/rd clut0/clut1 RAM through register
 *  PPA_SRM_CLUT_DATA_REG/PPA_BLEND0_CLUT_DATA_REG/PPA_BLEND1_CLUT_DATA_REG. 1'b1:
 *  memory mode to wr/rd sr/blend0/blend1 clut RAM. The bit 11 and 10 of the waddr
 *  should be 01 to access sr clut and should be 10 to access blend0 clut and should be
 *  11 to access blend 1 clut in memory mode.
 */
#define PPA_APB_FIFO_MASK    (BIT(0))
#define PPA_APB_FIFO_MASK_M  (PPA_APB_FIFO_MASK_V << PPA_APB_FIFO_MASK_S)
#define PPA_APB_FIFO_MASK_V  0x00000001U
#define PPA_APB_FIFO_MASK_S  0
/** PPA_BLEND0_CLUT_MEM_RST : R/W; bitpos: [1]; default: 0;
 *  Write 1 then write 0 to this bit to reset BLEND0 CLUT.
 */
#define PPA_BLEND0_CLUT_MEM_RST    (BIT(1))
#define PPA_BLEND0_CLUT_MEM_RST_M  (PPA_BLEND0_CLUT_MEM_RST_V << PPA_BLEND0_CLUT_MEM_RST_S)
#define PPA_BLEND0_CLUT_MEM_RST_V  0x00000001U
#define PPA_BLEND0_CLUT_MEM_RST_S  1
/** PPA_BLEND1_CLUT_MEM_RST : R/W; bitpos: [2]; default: 0;
 *  Write 1 then write 0 to this bit to reset BLEND1 CLUT.
 */
#define PPA_BLEND1_CLUT_MEM_RST    (BIT(2))
#define PPA_BLEND1_CLUT_MEM_RST_M  (PPA_BLEND1_CLUT_MEM_RST_V << PPA_BLEND1_CLUT_MEM_RST_S)
#define PPA_BLEND1_CLUT_MEM_RST_V  0x00000001U
#define PPA_BLEND1_CLUT_MEM_RST_S  2
/** PPA_BLEND0_CLUT_MEM_RDADDR_RST : R/W; bitpos: [3]; default: 0;
 *  Write 1 then write 0 to reset the read address of BLEND0 CLUT in fifo mode.
 */
#define PPA_BLEND0_CLUT_MEM_RDADDR_RST    (BIT(3))
#define PPA_BLEND0_CLUT_MEM_RDADDR_RST_M  (PPA_BLEND0_CLUT_MEM_RDADDR_RST_V << PPA_BLEND0_CLUT_MEM_RDADDR_RST_S)
#define PPA_BLEND0_CLUT_MEM_RDADDR_RST_V  0x00000001U
#define PPA_BLEND0_CLUT_MEM_RDADDR_RST_S  3
/** PPA_BLEND1_CLUT_MEM_RDADDR_RST : R/W; bitpos: [4]; default: 0;
 *  Write 1 then write 0 to reset the read address of BLEND1 CLUT in fifo mode.
 */
#define PPA_BLEND1_CLUT_MEM_RDADDR_RST    (BIT(4))
#define PPA_BLEND1_CLUT_MEM_RDADDR_RST_M  (PPA_BLEND1_CLUT_MEM_RDADDR_RST_V << PPA_BLEND1_CLUT_MEM_RDADDR_RST_S)
#define PPA_BLEND1_CLUT_MEM_RDADDR_RST_V  0x00000001U
#define PPA_BLEND1_CLUT_MEM_RDADDR_RST_S  4
/** PPA_BLEND_CLUT_MEM_FORCE_PD : R/W; bitpos: [5]; default: 0;
 *  1: force power down BLEND CLUT memory.
 */
#define PPA_BLEND_CLUT_MEM_FORCE_PD    (BIT(5))
#define PPA_BLEND_CLUT_MEM_FORCE_PD_M  (PPA_BLEND_CLUT_MEM_FORCE_PD_V << PPA_BLEND_CLUT_MEM_FORCE_PD_S)
#define PPA_BLEND_CLUT_MEM_FORCE_PD_V  0x00000001U
#define PPA_BLEND_CLUT_MEM_FORCE_PD_S  5
/** PPA_BLEND_CLUT_MEM_FORCE_PU : R/W; bitpos: [6]; default: 0;
 *  1: force power up BLEND CLUT memory.
 */
#define PPA_BLEND_CLUT_MEM_FORCE_PU    (BIT(6))
#define PPA_BLEND_CLUT_MEM_FORCE_PU_M  (PPA_BLEND_CLUT_MEM_FORCE_PU_V << PPA_BLEND_CLUT_MEM_FORCE_PU_S)
#define PPA_BLEND_CLUT_MEM_FORCE_PU_V  0x00000001U
#define PPA_BLEND_CLUT_MEM_FORCE_PU_S  6
/** PPA_BLEND_CLUT_MEM_CLK_ENA : R/W; bitpos: [7]; default: 0;
 *  1: Force clock on for BLEND CLUT memory.
 */
#define PPA_BLEND_CLUT_MEM_CLK_ENA    (BIT(7))
#define PPA_BLEND_CLUT_MEM_CLK_ENA_M  (PPA_BLEND_CLUT_MEM_CLK_ENA_V << PPA_BLEND_CLUT_MEM_CLK_ENA_S)
#define PPA_BLEND_CLUT_MEM_CLK_ENA_V  0x00000001U
#define PPA_BLEND_CLUT_MEM_CLK_ENA_S  7

/** PPA_INT_RAW_REG register
 *  Raw status interrupt
 */
#define PPA_INT_RAW_REG (DR_REG_PPA_BASE + 0x10)
/** PPA_SRM_EOF_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when scaling and rotating engine
 *  calculate one frame image.
 */
#define PPA_SRM_EOF_INT_RAW    (BIT(0))
#define PPA_SRM_EOF_INT_RAW_M  (PPA_SRM_EOF_INT_RAW_V << PPA_SRM_EOF_INT_RAW_S)
#define PPA_SRM_EOF_INT_RAW_V  0x00000001U
#define PPA_SRM_EOF_INT_RAW_S  0
/** PPA_BLEND_EOF_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when blending engine calculate one frame
 *  image.
 */
#define PPA_BLEND_EOF_INT_RAW    (BIT(1))
#define PPA_BLEND_EOF_INT_RAW_M  (PPA_BLEND_EOF_INT_RAW_V << PPA_BLEND_EOF_INT_RAW_S)
#define PPA_BLEND_EOF_INT_RAW_V  0x00000001U
#define PPA_BLEND_EOF_INT_RAW_S  1
/** PPA_SRM_PARAM_CFG_ERR_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when the configured scaling and rotating
 *  coefficient is wrong. User can check the reasons through register
 *  PPA_SRM_PARAM_ERR_ST_REG.
 */
#define PPA_SRM_PARAM_CFG_ERR_INT_RAW    (BIT(2))
#define PPA_SRM_PARAM_CFG_ERR_INT_RAW_M  (PPA_SRM_PARAM_CFG_ERR_INT_RAW_V << PPA_SRM_PARAM_CFG_ERR_INT_RAW_S)
#define PPA_SRM_PARAM_CFG_ERR_INT_RAW_V  0x00000001U
#define PPA_SRM_PARAM_CFG_ERR_INT_RAW_S  2
/** PPA_BLEND_PARAM_CFG_ERR_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when the configured blending coefficient
 *  is wrong. User can check the reasons through register PPA_BLEND_ST_REG.
 */
#define PPA_BLEND_PARAM_CFG_ERR_INT_RAW    (BIT(3))
#define PPA_BLEND_PARAM_CFG_ERR_INT_RAW_M  (PPA_BLEND_PARAM_CFG_ERR_INT_RAW_V << PPA_BLEND_PARAM_CFG_ERR_INT_RAW_S)
#define PPA_BLEND_PARAM_CFG_ERR_INT_RAW_V  0x00000001U
#define PPA_BLEND_PARAM_CFG_ERR_INT_RAW_S  3

