espressif/esp-idf/components/soc/esp32s31/register/soc/ppa_reg.h
/** PPA_BLEND_RGB_REG register
 *  RGB color register
 */
#define PPA_BLEND_RGB_REG (DR_REG_PPA_BASE + 0x48)
/** PPA_BLEND1_RX_B : R/W; bitpos: [7:0]; default: 128;
 *  blue color for A4/A8 mode.
 */
#define PPA_BLEND1_RX_B    0x000000FFU
#define PPA_BLEND1_RX_B_M  (PPA_BLEND1_RX_B_V << PPA_BLEND1_RX_B_S)
#define PPA_BLEND1_RX_B_V  0x000000FFU
#define PPA_BLEND1_RX_B_S  0
/** PPA_BLEND1_RX_G : R/W; bitpos: [15:8]; default: 128;
 *  green color for A4/A8 mode.
 */
#define PPA_BLEND1_RX_G    0x000000FFU
#define PPA_BLEND1_RX_G_M  (PPA_BLEND1_RX_G_V << PPA_BLEND1_RX_G_S)
#define PPA_BLEND1_RX_G_V  0x000000FFU
#define PPA_BLEND1_RX_G_S  8
/** PPA_BLEND1_RX_R : R/W; bitpos: [23:16]; default: 128;
 *  red color for A4/A8 mode.
 */
#define PPA_BLEND1_RX_R    0x000000FFU
#define PPA_BLEND1_RX_R_M  (PPA_BLEND1_RX_R_V << PPA_BLEND1_RX_R_S)
#define PPA_BLEND1_RX_R_V  0x000000FFU
#define PPA_BLEND1_RX_R_S  16

/** PPA_BLEND_FIX_PIXEL_REG register
 *  Blending engine fix pixel register
 */
#define PPA_BLEND_FIX_PIXEL_REG (DR_REG_PPA_BASE + 0x4c)
/** PPA_BLEND_TX_FIX_PIXEL : R/W; bitpos: [31:0]; default: 0;
 *  The configure fix pixel in fix pixel filling mode for blender engine.
 */
#define PPA_BLEND_TX_FIX_PIXEL    0xFFFFFFFFU
#define PPA_BLEND_TX_FIX_PIXEL_M  (PPA_BLEND_TX_FIX_PIXEL_V << PPA_BLEND_TX_FIX_PIXEL_S)
#define PPA_BLEND_TX_FIX_PIXEL_V  0xFFFFFFFFU
#define PPA_BLEND_TX_FIX_PIXEL_S  0

/** PPA_CK_FG_LOW_REG register
 *  foreground color key lower threshold
 */
#define PPA_CK_FG_LOW_REG (DR_REG_PPA_BASE + 0x50)
/** PPA_COLORKEY_FG_B_LOW : R/W; bitpos: [7:0]; default: 255;
 *  color key lower threshold of foreground b channel
 */
#define PPA_COLORKEY_FG_B_LOW    0x000000FFU
#define PPA_COLORKEY_FG_B_LOW_M  (PPA_COLORKEY_FG_B_LOW_V << PPA_COLORKEY_FG_B_LOW_S)
#define PPA_COLORKEY_FG_B_LOW_V  0x000000FFU
#define PPA_COLORKEY_FG_B_LOW_S  0
/** PPA_COLORKEY_FG_G_LOW : R/W; bitpos: [15:8]; default: 255;
 *  color key lower threshold of foreground g channel
 */
#define PPA_COLORKEY_FG_G_LOW    0x000000FFU
#define PPA_COLORKEY_FG_G_LOW_M  (PPA_COLORKEY_FG_G_LOW_V << PPA_COLORKEY_FG_G_LOW_S)
#define PPA_COLORKEY_FG_G_LOW_V  0x000000FFU
#define PPA_COLORKEY_FG_G_LOW_S  8
/** PPA_COLORKEY_FG_R_LOW : R/W; bitpos: [23:16]; default: 255;
 *  color key lower threshold of foreground r channel
 */
#define PPA_COLORKEY_FG_R_LOW    0x000000FFU
#define PPA_COLORKEY_FG_R_LOW_M  (PPA_COLORKEY_FG_R_LOW_V << PPA_COLORKEY_FG_R_LOW_S)
#define PPA_COLORKEY_FG_R_LOW_V  0x000000FFU
#define PPA_COLORKEY_FG_R_LOW_S  16

/** PPA_CK_FG_HIGH_REG register
 *  foreground color key higher threshold
 */
#define PPA_CK_FG_HIGH_REG (DR_REG_PPA_BASE + 0x54)
/** PPA_COLORKEY_FG_B_HIGH : R/W; bitpos: [7:0]; default: 0;
 *  color key higher threshold of foreground b channel
 */
#define PPA_COLORKEY_FG_B_HIGH    0x000000FFU
#define PPA_COLORKEY_FG_B_HIGH_M  (PPA_COLORKEY_FG_B_HIGH_V << PPA_COLORKEY_FG_B_HIGH_S)
#define PPA_COLORKEY_FG_B_HIGH_V  0x000000FFU
#define PPA_COLORKEY_FG_B_HIGH_S  0
/** PPA_COLORKEY_FG_G_HIGH : R/W; bitpos: [15:8]; default: 0;
 *  color key higher threshold of foreground g channel
 */
#define PPA_COLORKEY_FG_G_HIGH    0x000000FFU
#define PPA_COLORKEY_FG_G_HIGH_M  (PPA_COLORKEY_FG_G_HIGH_V << PPA_COLORKEY_FG_G_HIGH_S)
#define PPA_COLORKEY_FG_G_HIGH_V  0x000000FFU
#define PPA_COLORKEY_FG_G_HIGH_S  8
/** PPA_COLORKEY_FG_R_HIGH : R/W; bitpos: [23:16]; default: 0;
 *  color key higher threshold of foreground r channel
 */
#define PPA_COLORKEY_FG_R_HIGH    0x000000FFU
#define PPA_COLORKEY_FG_R_HIGH_M  (PPA_COLORKEY_FG_R_HIGH_V << PPA_COLORKEY_FG_R_HIGH_S)
#define PPA_COLORKEY_FG_R_HIGH_V  0x000000FFU
#define PPA_COLORKEY_FG_R_HIGH_S  16

/** PPA_CK_BG_LOW_REG register
 *  background color key lower threshold
 */
#define PPA_CK_BG_LOW_REG (DR_REG_PPA_BASE + 0x58)
/** PPA_COLORKEY_BG_B_LOW : R/W; bitpos: [7:0]; default: 255;
 *  color key lower threshold of background b channel
 */
#define PPA_COLORKEY_BG_B_LOW    0x000000FFU
#define PPA_COLORKEY_BG_B_LOW_M  (PPA_COLORKEY_BG_B_LOW_V << PPA_COLORKEY_BG_B_LOW_S)
#define PPA_COLORKEY_BG_B_LOW_V  0x000000FFU
#define PPA_COLORKEY_BG_B_LOW_S  0
/** PPA_COLORKEY_BG_G_LOW : R/W; bitpos: [15:8]; default: 255;
 *  color key lower threshold of background g channel
 */
#define PPA_COLORKEY_BG_G_LOW    0x000000FFU
#define PPA_COLORKEY_BG_G_LOW_M  (PPA_COLORKEY_BG_G_LOW_V << PPA_COLORKEY_BG_G_LOW_S)
#define PPA_COLORKEY_BG_G_LOW_V  0x000000FFU
#define PPA_COLORKEY_BG_G_LOW_S  8
/** PPA_COLORKEY_BG_R_LOW : R/W; bitpos: [23:16]; default: 255;
 *  color key lower threshold of background r channel
 */
#define PPA_COLORKEY_BG_R_LOW    0x000000FFU
#define PPA_COLORKEY_BG_R_LOW_M  (PPA_COLORKEY_BG_R_LOW_V << PPA_COLORKEY_BG_R_LOW_S)
#define PPA_COLORKEY_BG_R_LOW_V  0x000000FFU
#define PPA_COLORKEY_BG_R_LOW_S  16

/** PPA_CK_BG_HIGH_REG register
 *  background color key higher threshold
 */
#define PPA_CK_BG_HIGH_REG (DR_REG_PPA_BASE + 0x5c)
/** PPA_COLORKEY_BG_B_HIGH : R/W; bitpos: [7:0]; default: 0;
 *  color key higher threshold of background b channel
 */
#define PPA_COLORKEY_BG_B_HIGH    0x000000FFU
#define PPA_COLORKEY_BG_B_HIGH_M  (PPA_COLORKEY_BG_B_HIGH_V << PPA_COLORKEY_BG_B_HIGH_S)
#define PPA_COLORKEY_BG_B_HIGH_V  0x000000FFU
#define PPA_COLORKEY_BG_B_HIGH_S  0
/** PPA_COLORKEY_BG_G_HIGH : R/W; bitpos: [15:8]; default: 0;
 *  color key higher threshold of background g channel
 */
#define PPA_COLORKEY_BG_G_HIGH    0x000000FFU
#define PPA_COLORKEY_BG_G_HIGH_M  (PPA_COLORKEY_BG_G_HIGH_V << PPA_COLORKEY_BG_G_HIGH_S)
#define PPA_COLORKEY_BG_G_HIGH_V  0x000000FFU
#define PPA_COLORKEY_BG_G_HIGH_S  8
/** PPA_COLORKEY_BG_R_HIGH : R/W; bitpos: [23:16]; default: 0;
 *  color key higher threshold of background r channel
 */
#define PPA_COLORKEY_BG_R_HIGH    0x000000FFU
#define PPA_COLORKEY_BG_R_HIGH_M  (PPA_COLORKEY_BG_R_HIGH_V << PPA_COLORKEY_BG_R_HIGH_S)
#define PPA_COLORKEY_BG_R_HIGH_V  0x000000FFU
#define PPA_COLORKEY_BG_R_HIGH_S  16

/** PPA_CK_DEFAULT_REG register
 *  default value when foreground and background both in color key range
 */
#define PPA_CK_DEFAULT_REG (DR_REG_PPA_BASE + 0x60)
/** PPA_COLORKEY_DEFAULT_B : R/W; bitpos: [7:0]; default: 0;
 *  default B channel value of color key
 */
#define PPA_COLORKEY_DEFAULT_B    0x000000FFU
#define PPA_COLORKEY_DEFAULT_B_M  (PPA_COLORKEY_DEFAULT_B_V << PPA_COLORKEY_DEFAULT_B_S)
#define PPA_COLORKEY_DEFAULT_B_V  0x000000FFU
#define PPA_COLORKEY_DEFAULT_B_S  0
/** PPA_COLORKEY_DEFAULT_G : R/W; bitpos: [15:8]; default: 0;
 *  default G channel value of color key
 */
#define PPA_COLORKEY_DEFAULT_G    0x000000FFU
#define PPA_COLORKEY_DEFAULT_G_M  (PPA_COLORKEY_DEFAULT_G_V << PPA_COLORKEY_DEFAULT_G_S)
#define PPA_COLORKEY_DEFAULT_G_V  0x000000FFU
#define PPA_COLORKEY_DEFAULT_G_S  8
/** PPA_COLORKEY_DEFAULT_R : R/W; bitpos: [23:16]; default: 0;
 *  default R channel value of color key
 */
#define PPA_COLORKEY_DEFAULT_R    0x000000FFU
#define PPA_COLORKEY_DEFAULT_R_M  (PPA_COLORKEY_DEFAULT_R_V << PPA_COLORKEY_DEFAULT_R_S)
#define PPA_COLORKEY_DEFAULT_R_V  0x000000FFU
#define PPA_COLORKEY_DEFAULT_R_S  16
/** PPA_COLORKEY_FG_BG_REVERSE : R/W; bitpos: [24]; default: 0;
 *  when pixel in bg ck range but not in fg ck range, 0: the result is bg, 1: the
 *  result is fg
 */
#define PPA_COLORKEY_FG_BG_REVERSE    (BIT(24))
#define PPA_COLORKEY_FG_BG_REVERSE_M  (PPA_COLORKEY_FG_BG_REVERSE_V << PPA_COLORKEY_FG_BG_REVERSE_S)
#define PPA_COLORKEY_FG_BG_REVERSE_V  0x00000001U
#define PPA_COLORKEY_FG_BG_REVERSE_S  24

/** PPA_SRM_SCAL_ROTATE_REG register
 *  Scaling and rotating coefficient register
 */
#define PPA_SRM_SCAL_ROTATE_REG (DR_REG_PPA_BASE + 0x64)
/** PPA_SRM_SCAL_X_INT : R/W; bitpos: [7:0]; default: 1;
 *  The integrated part of scaling coefficient in X direction.
 */
#define PPA_SRM_SCAL_X_INT    0x000000FFU
#define PPA_SRM_SCAL_X_INT_M  (PPA_SRM_SCAL_X_INT_V << PPA_SRM_SCAL_X_INT_S)
#define PPA_SRM_SCAL_X_INT_V  0x000000FFU
#define PPA_SRM_SCAL_X_INT_S  0
/** PPA_SRM_SCAL_X_FRAG : R/W; bitpos: [11:8]; default: 0;
 *  The fragment part of scaling coefficient in X direction.
 */
#define PPA_SRM_SCAL_X_FRAG    0x0000000FU
#define PPA_SRM_SCAL_X_FRAG_M  (PPA_SRM_SCAL_X_FRAG_V << PPA_SRM_SCAL_X_FRAG_S)
#define PPA_SRM_SCAL_X_FRAG_V  0x0000000FU
#define PPA_SRM_SCAL_X_FRAG_S  8
/** PPA_SRM_SCAL_Y_INT : R/W; bitpos: [19:12]; default: 1;
 *  The integrated part of scaling coefficient in Y direction.
 */
#define PPA_SRM_SCAL_Y_INT    0x000000FFU
#define PPA_SRM_SCAL_Y_INT_M  (PPA_SRM_SCAL_Y_INT_V << PPA_SRM_SCAL_Y_INT_S)
#define PPA_SRM_SCAL_Y_INT_V  0x000000FFU
#define PPA_SRM_SCAL_Y_INT_S  12
/** PPA_SRM_SCAL_Y_FRAG : R/W; bitpos: [23:20]; default: 0;
 *  The fragment part of scaling coefficient in Y direction.
 */
#define PPA_SRM_SCAL_Y_FRAG    0x0000000FU
#define PPA_SRM_SCAL_Y_FRAG_M  (PPA_SRM_SCAL_Y_FRAG_V << PPA_SRM_SCAL_Y_FRAG_S)
#define PPA_SRM_SCAL_Y_FRAG_V  0x0000000FU
#define PPA_SRM_SCAL_Y_FRAG_S  20
/** PPA_SRM_ROTATE_ANGLE : R/W; bitpos: [25:24]; default: 0;
 *  The rotate angle. 0: 0 degree. 1: 90 degree. 2: 180 degree. 3: 270 degree.
 */
#define PPA_SRM_ROTATE_ANGLE    0x00000003U
#define PPA_SRM_ROTATE_ANGLE_M  (PPA_SRM_ROTATE_ANGLE_V << PPA_SRM_ROTATE_ANGLE_S)
#define PPA_SRM_ROTATE_ANGLE_V  0x00000003U
#define PPA_SRM_ROTATE_ANGLE_S  24
/** PPA_SCAL_ROTATE_RST : R/W; bitpos: [26]; default: 0;
 *  Write 1 then write 0 to this bit to reset scaling and rotating engine.
 */
#define PPA_SCAL_ROTATE_RST    (BIT(26))
#define PPA_SCAL_ROTATE_RST_M  (PPA_SCAL_ROTATE_RST_V << PPA_SCAL_ROTATE_RST_S)
#define PPA_SCAL_ROTATE_RST_V  0x00000001U
#define PPA_SCAL_ROTATE_RST_S  26
/** PPA_SCAL_ROTATE_START : WT; bitpos: [27]; default: 0;
 *  Write 1 to enable scaling and rotating engine after parameter is configured.
 */
#define PPA_SCAL_ROTATE_START    (BIT(27))
#define PPA_SCAL_ROTATE_START_M  (PPA_SCAL_ROTATE_START_V << PPA_SCAL_ROTATE_START_S)
#define PPA_SCAL_ROTATE_START_V  0x00000001U
#define PPA_SCAL_ROTATE_START_S  27
/** PPA_SRM_MIRROR_X : R/W; bitpos: [28]; default: 0;
 *  Image mirror in X direction. 0: disable, 1: enable
 */
#define PPA_SRM_MIRROR_X    (BIT(28))
#define PPA_SRM_MIRROR_X_M  (PPA_SRM_MIRROR_X_V << PPA_SRM_MIRROR_X_S)
#define PPA_SRM_MIRROR_X_V  0x00000001U
#define PPA_SRM_MIRROR_X_S  28
/** PPA_SRM_MIRROR_Y : R/W; bitpos: [29]; default: 0;
 *  Image mirror in Y direction. 0: disable, 1: enable
 */
#define PPA_SRM_MIRROR_Y    (BIT(29))
#define PPA_SRM_MIRROR_Y_M  (PPA_SRM_MIRROR_Y_V << PPA_SRM_MIRROR_Y_S)
#define PPA_SRM_MIRROR_Y_V  0x00000001U
#define PPA_SRM_MIRROR_Y_S  29

/** PPA_SRM_MEM_PD_REG register
 *  SR memory power done register
 */
#define PPA_SRM_MEM_PD_REG (DR_REG_PPA_BASE + 0x68)
/** PPA_SRM_MEM_CLK_ENA : R/W; bitpos: [0]; default: 0;
 *  Set this bit to force clock enable of scaling and rotating engine's data memory.
 */
#define PPA_SRM_MEM_CLK_ENA    (BIT(0))
#define PPA_SRM_MEM_CLK_ENA_M  (PPA_SRM_MEM_CLK_ENA_V << PPA_SRM_MEM_CLK_ENA_S)
#define PPA_SRM_MEM_CLK_ENA_V  0x00000001U
#define PPA_SRM_MEM_CLK_ENA_S  0
/** PPA_SRM_MEM_FORCE_PD : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force power down scaling and rotating engine's data memory.
 */
#define PPA_SRM_MEM_FORCE_PD    (BIT(1))
#define PPA_SRM_MEM_FORCE_PD_M  (PPA_SRM_MEM_FORCE_PD_V << PPA_SRM_MEM_FORCE_PD_S)
#define PPA_SRM_MEM_FORCE_PD_V  0x00000001U
#define PPA_SRM_MEM_FORCE_PD_S  1
/** PPA_SRM_MEM_FORCE_PU : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power up scaling and rotating engine's data memory.
 */
#define PPA_SRM_MEM_FORCE_PU    (BIT(2))
#define PPA_SRM_MEM_FORCE_PU_M  (PPA_SRM_MEM_FORCE_PU_V << PPA_SRM_MEM_FORCE_PU_S)
#define PPA_SRM_MEM_FORCE_PU_V  0x00000001U
#define PPA_SRM_MEM_FORCE_PU_S  2

/** PPA_REG_CONF_REG register
 *  Register clock enable register
 */
#define PPA_REG_CONF_REG (DR_REG_PPA_BASE + 0x6c)
/** PPA_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  PPA register clock gate enable signal.
 */
#define PPA_CLK_EN    (BIT(0))
#define PPA_CLK_EN_M  (PPA_CLK_EN_V << PPA_CLK_EN_S)
#define PPA_CLK_EN_V  0x00000001U
#define PPA_CLK_EN_S  0

