espressif/esp-idf/components/soc/esp32s31/register/soc/ppa_reg.h
/** PPA_CLUT_CNT_REG register
 *  BLEND CLUT write counter register
 */
#define PPA_CLUT_CNT_REG (DR_REG_PPA_BASE + 0x70)
/** PPA_BLEND0_CLUT_CNT : RO; bitpos: [8:0]; default: 0;
 *  The write data counter of BLEND0 CLUT in fifo mode.
 */
#define PPA_BLEND0_CLUT_CNT    0x000001FFU
#define PPA_BLEND0_CLUT_CNT_M  (PPA_BLEND0_CLUT_CNT_V << PPA_BLEND0_CLUT_CNT_S)
#define PPA_BLEND0_CLUT_CNT_V  0x000001FFU
#define PPA_BLEND0_CLUT_CNT_S  0
/** PPA_BLEND1_CLUT_CNT : RO; bitpos: [17:9]; default: 0;
 *  The write data counter of BLEND1 CLUT in fifo mode.
 */
#define PPA_BLEND1_CLUT_CNT    0x000001FFU
#define PPA_BLEND1_CLUT_CNT_M  (PPA_BLEND1_CLUT_CNT_V << PPA_BLEND1_CLUT_CNT_S)
#define PPA_BLEND1_CLUT_CNT_V  0x000001FFU
#define PPA_BLEND1_CLUT_CNT_S  9

/** PPA_BLEND_ST_REG register
 *  Blending engine status register
 */
#define PPA_BLEND_ST_REG (DR_REG_PPA_BASE + 0x74)
/** PPA_BLEND_SIZE_DIFF_ST : RO; bitpos: [0]; default: 0;
 *  1: indicate the size of two image is different.
 */
#define PPA_BLEND_SIZE_DIFF_ST    (BIT(0))
#define PPA_BLEND_SIZE_DIFF_ST_M  (PPA_BLEND_SIZE_DIFF_ST_V << PPA_BLEND_SIZE_DIFF_ST_S)
#define PPA_BLEND_SIZE_DIFF_ST_V  0x00000001U
#define PPA_BLEND_SIZE_DIFF_ST_S  0
/** PPA_BLEND_YUV_X_SCALE_ERR_ST : RO; bitpos: [1]; default: 0;
 *  Represents that x param is an odd num when enable yuv422 or yuv420
 */
#define PPA_BLEND_YUV_X_SCALE_ERR_ST    (BIT(1))
#define PPA_BLEND_YUV_X_SCALE_ERR_ST_M  (PPA_BLEND_YUV_X_SCALE_ERR_ST_V << PPA_BLEND_YUV_X_SCALE_ERR_ST_S)
#define PPA_BLEND_YUV_X_SCALE_ERR_ST_V  0x00000001U
#define PPA_BLEND_YUV_X_SCALE_ERR_ST_S  1
/** PPA_BLEND_YUV_Y_SCALE_ERR_ST : RO; bitpos: [2]; default: 0;
 *  Represents that y param is an odd num when enable yuv420
 */
#define PPA_BLEND_YUV_Y_SCALE_ERR_ST    (BIT(2))
#define PPA_BLEND_YUV_Y_SCALE_ERR_ST_M  (PPA_BLEND_YUV_Y_SCALE_ERR_ST_V << PPA_BLEND_YUV_Y_SCALE_ERR_ST_S)
#define PPA_BLEND_YUV_Y_SCALE_ERR_ST_V  0x00000001U
#define PPA_BLEND_YUV_Y_SCALE_ERR_ST_S  2

/** PPA_SRM_PARAM_ERR_ST_REG register
 *  Scaling and rotating coefficient error register
 */
#define PPA_SRM_PARAM_ERR_ST_REG (DR_REG_PPA_BASE + 0x78)
/** PPA_TX_DSCR_VB_ERR_ST : RO; bitpos: [0]; default: 0;
 *  The error is that the scaled VB plus the offset of Y coordinate in 2DDMA receive
 *  descriptor is larger than VA in 2DDMA receive descriptor.
 */
#define PPA_TX_DSCR_VB_ERR_ST    (BIT(0))
#define PPA_TX_DSCR_VB_ERR_ST_M  (PPA_TX_DSCR_VB_ERR_ST_V << PPA_TX_DSCR_VB_ERR_ST_S)
#define PPA_TX_DSCR_VB_ERR_ST_V  0x00000001U
#define PPA_TX_DSCR_VB_ERR_ST_S  0
/** PPA_TX_DSCR_HB_ERR_ST : RO; bitpos: [1]; default: 0;
 *  The error is that the scaled HB plus the offset of X coordinate in 2DDMA receive
 *  descriptor is larger than HA in 2DDMA receive descriptor.
 */
#define PPA_TX_DSCR_HB_ERR_ST    (BIT(1))
#define PPA_TX_DSCR_HB_ERR_ST_M  (PPA_TX_DSCR_HB_ERR_ST_V << PPA_TX_DSCR_HB_ERR_ST_S)
#define PPA_TX_DSCR_HB_ERR_ST_V  0x00000001U
#define PPA_TX_DSCR_HB_ERR_ST_S  1
/** PPA_Y_RX_SCAL_EQUAL_0_ERR_ST : RO; bitpos: [2]; default: 0;
 *  The error is that the PPA_SRM_SCAL_Y_INT and PPA_SRM_CAL_Y_FRAG both are 0.
 */
#define PPA_Y_RX_SCAL_EQUAL_0_ERR_ST    (BIT(2))
#define PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_M  (PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_V << PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_S)
#define PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_V  0x00000001U
#define PPA_Y_RX_SCAL_EQUAL_0_ERR_ST_S  2
/** PPA_RX_DSCR_VB_ERR_ST : RO; bitpos: [3]; default: 0;
 *  The error is that VB in 2DDMA receive descriptor plus the offset of Y coordinate in
 *  2DDMA transmit descriptor is larger than VA in 2DDMA transmit descriptor
 */
#define PPA_RX_DSCR_VB_ERR_ST    (BIT(3))
#define PPA_RX_DSCR_VB_ERR_ST_M  (PPA_RX_DSCR_VB_ERR_ST_V << PPA_RX_DSCR_VB_ERR_ST_S)
#define PPA_RX_DSCR_VB_ERR_ST_V  0x00000001U
#define PPA_RX_DSCR_VB_ERR_ST_S  3
/** PPA_YDST_LEN_TOO_SAMLL_ERR_ST : RO; bitpos: [4]; default: 0;
 *  The error is that the scaled image width is 0. For example.  when source width is
 *  14. scaled value is 1/16. and no rotate operation. then scaled width would be 0 as
 *  the result would be floored.
 */
#define PPA_YDST_LEN_TOO_SAMLL_ERR_ST    (BIT(4))
#define PPA_YDST_LEN_TOO_SAMLL_ERR_ST_M  (PPA_YDST_LEN_TOO_SAMLL_ERR_ST_V << PPA_YDST_LEN_TOO_SAMLL_ERR_ST_S)
#define PPA_YDST_LEN_TOO_SAMLL_ERR_ST_V  0x00000001U
#define PPA_YDST_LEN_TOO_SAMLL_ERR_ST_S  4
/** PPA_YDST_LEN_TOO_LARGE_ERR_ST : RO; bitpos: [5]; default: 0;
 *  The error is that the scaled width is larger than (2^13 - 1).
 */
#define PPA_YDST_LEN_TOO_LARGE_ERR_ST    (BIT(5))
#define PPA_YDST_LEN_TOO_LARGE_ERR_ST_M  (PPA_YDST_LEN_TOO_LARGE_ERR_ST_V << PPA_YDST_LEN_TOO_LARGE_ERR_ST_S)
#define PPA_YDST_LEN_TOO_LARGE_ERR_ST_V  0x00000001U
#define PPA_YDST_LEN_TOO_LARGE_ERR_ST_S  5
/** PPA_X_RX_SCAL_EQUAL_0_ERR_ST : RO; bitpos: [6]; default: 0;
 *  The error is that the scaled image height is 0.
 */
#define PPA_X_RX_SCAL_EQUAL_0_ERR_ST    (BIT(6))
#define PPA_X_RX_SCAL_EQUAL_0_ERR_ST_M  (PPA_X_RX_SCAL_EQUAL_0_ERR_ST_V << PPA_X_RX_SCAL_EQUAL_0_ERR_ST_S)
#define PPA_X_RX_SCAL_EQUAL_0_ERR_ST_V  0x00000001U
#define PPA_X_RX_SCAL_EQUAL_0_ERR_ST_S  6
/** PPA_RX_DSCR_HB_ERR_ST : RO; bitpos: [7]; default: 0;
 *  The error is that the HB in 2DDMA transmit descriptor plus the offset of X
 *  coordinate in 2DDMA transmit descriptor is larger than HA in 2DDMA transmit
 *  descriptor.
 */
#define PPA_RX_DSCR_HB_ERR_ST    (BIT(7))
#define PPA_RX_DSCR_HB_ERR_ST_M  (PPA_RX_DSCR_HB_ERR_ST_V << PPA_RX_DSCR_HB_ERR_ST_S)
#define PPA_RX_DSCR_HB_ERR_ST_V  0x00000001U
#define PPA_RX_DSCR_HB_ERR_ST_S  7
/** PPA_XDST_LEN_TOO_SAMLL_ERR_ST : RO; bitpos: [8]; default: 0;
 *  The error is that the scaled image height is 0. For example.  when source height is
 *  14. scaled value is 1/16. and no rotate operation. then scaled height would be 0 as
 *  the result would be floored.
 */
#define PPA_XDST_LEN_TOO_SAMLL_ERR_ST    (BIT(8))
#define PPA_XDST_LEN_TOO_SAMLL_ERR_ST_M  (PPA_XDST_LEN_TOO_SAMLL_ERR_ST_V << PPA_XDST_LEN_TOO_SAMLL_ERR_ST_S)
#define PPA_XDST_LEN_TOO_SAMLL_ERR_ST_V  0x00000001U
#define PPA_XDST_LEN_TOO_SAMLL_ERR_ST_S  8
/** PPA_XDST_LEN_TOO_LARGE_ERR_ST : RO; bitpos: [9]; default: 0;
 *  The error is that the scaled image height is larger than (2^13 - 1).
 */
#define PPA_XDST_LEN_TOO_LARGE_ERR_ST    (BIT(9))
#define PPA_XDST_LEN_TOO_LARGE_ERR_ST_M  (PPA_XDST_LEN_TOO_LARGE_ERR_ST_V << PPA_XDST_LEN_TOO_LARGE_ERR_ST_S)
#define PPA_XDST_LEN_TOO_LARGE_ERR_ST_V  0x00000001U
#define PPA_XDST_LEN_TOO_LARGE_ERR_ST_S  9
/** PPA_X_YUV_RX_SCALE_ERR_ST : RO; bitpos: [10]; default: 0;
 *  The error is that the ha/hb/x param in dma2d descriptor is an odd num when enable
 *  yuv422 or yuv420 rx
 */
#define PPA_X_YUV_RX_SCALE_ERR_ST    (BIT(10))
#define PPA_X_YUV_RX_SCALE_ERR_ST_M  (PPA_X_YUV_RX_SCALE_ERR_ST_V << PPA_X_YUV_RX_SCALE_ERR_ST_S)
#define PPA_X_YUV_RX_SCALE_ERR_ST_V  0x00000001U
#define PPA_X_YUV_RX_SCALE_ERR_ST_S  10
/** PPA_Y_YUV_RX_SCALE_ERR_ST : RO; bitpos: [11]; default: 0;
 *  The error is that the va/vb/y param in dma2d descriptor is an odd num when enable
 *  yuv420 rx
 */
#define PPA_Y_YUV_RX_SCALE_ERR_ST    (BIT(11))
#define PPA_Y_YUV_RX_SCALE_ERR_ST_M  (PPA_Y_YUV_RX_SCALE_ERR_ST_V << PPA_Y_YUV_RX_SCALE_ERR_ST_S)
#define PPA_Y_YUV_RX_SCALE_ERR_ST_V  0x00000001U
#define PPA_Y_YUV_RX_SCALE_ERR_ST_S  11
/** PPA_X_YUV_TX_SCALE_ERR_ST : RO; bitpos: [12]; default: 0;
 *  The error is that the ha/hb/x param in dma2d descriptor is an odd num when enable
 *  yuv422 or yuv420 tx
 */
#define PPA_X_YUV_TX_SCALE_ERR_ST    (BIT(12))
#define PPA_X_YUV_TX_SCALE_ERR_ST_M  (PPA_X_YUV_TX_SCALE_ERR_ST_V << PPA_X_YUV_TX_SCALE_ERR_ST_S)
#define PPA_X_YUV_TX_SCALE_ERR_ST_V  0x00000001U
#define PPA_X_YUV_TX_SCALE_ERR_ST_S  12
/** PPA_Y_YUV_TX_SCALE_ERR_ST : RO; bitpos: [13]; default: 0;
 *  The error is that the va/vb/y param in dma2d descriptor is an odd num when enable
 *  yuv420 tx
 */
#define PPA_Y_YUV_TX_SCALE_ERR_ST    (BIT(13))
#define PPA_Y_YUV_TX_SCALE_ERR_ST_M  (PPA_Y_YUV_TX_SCALE_ERR_ST_V << PPA_Y_YUV_TX_SCALE_ERR_ST_S)
#define PPA_Y_YUV_TX_SCALE_ERR_ST_V  0x00000001U
#define PPA_Y_YUV_TX_SCALE_ERR_ST_S  13

/** PPA_SRM_STATUS_REG register
 *  SR FSM register
 */
#define PPA_SRM_STATUS_REG (DR_REG_PPA_BASE + 0x7c)
/** PPA_SRM_RX_DSCR_SAMPLE_STATE : RO; bitpos: [1:0]; default: 0;
 *  Reserved.
 */
#define PPA_SRM_RX_DSCR_SAMPLE_STATE    0x00000003U
#define PPA_SRM_RX_DSCR_SAMPLE_STATE_M  (PPA_SRM_RX_DSCR_SAMPLE_STATE_V << PPA_SRM_RX_DSCR_SAMPLE_STATE_S)
#define PPA_SRM_RX_DSCR_SAMPLE_STATE_V  0x00000003U
#define PPA_SRM_RX_DSCR_SAMPLE_STATE_S  0
/** PPA_SRM_RX_SCAN_STATE : RO; bitpos: [3:2]; default: 0;
 *  Reserved.
 */
#define PPA_SRM_RX_SCAN_STATE    0x00000003U
#define PPA_SRM_RX_SCAN_STATE_M  (PPA_SRM_RX_SCAN_STATE_V << PPA_SRM_RX_SCAN_STATE_S)
#define PPA_SRM_RX_SCAN_STATE_V  0x00000003U
#define PPA_SRM_RX_SCAN_STATE_S  2
/** PPA_SRM_TX_DSCR_SAMPLE_STATE : RO; bitpos: [5:4]; default: 0;
 *  Reserved.
 */
#define PPA_SRM_TX_DSCR_SAMPLE_STATE    0x00000003U
#define PPA_SRM_TX_DSCR_SAMPLE_STATE_M  (PPA_SRM_TX_DSCR_SAMPLE_STATE_V << PPA_SRM_TX_DSCR_SAMPLE_STATE_S)
#define PPA_SRM_TX_DSCR_SAMPLE_STATE_V  0x00000003U
#define PPA_SRM_TX_DSCR_SAMPLE_STATE_S  4
/** PPA_SRM_TX_SCAN_STATE : RO; bitpos: [8:6]; default: 0;
 *  Reserved.
 */
#define PPA_SRM_TX_SCAN_STATE    0x00000007U
#define PPA_SRM_TX_SCAN_STATE_M  (PPA_SRM_TX_SCAN_STATE_V << PPA_SRM_TX_SCAN_STATE_S)
#define PPA_SRM_TX_SCAN_STATE_V  0x00000007U
#define PPA_SRM_TX_SCAN_STATE_S  6

