espressif/esp-idf/components/soc/esp32s31/register/soc/ppa_reg.h
/** PPA_ECO_LOW_REG register
 *  Reserved.
 */
#define PPA_ECO_LOW_REG (DR_REG_PPA_BASE + 0x80)
/** PPA_RND_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  Reserved.
 */
#define PPA_RND_ECO_LOW    0xFFFFFFFFU
#define PPA_RND_ECO_LOW_M  (PPA_RND_ECO_LOW_V << PPA_RND_ECO_LOW_S)
#define PPA_RND_ECO_LOW_V  0xFFFFFFFFU
#define PPA_RND_ECO_LOW_S  0

/** PPA_ECO_HIGH_REG register
 *  Reserved.
 */
#define PPA_ECO_HIGH_REG (DR_REG_PPA_BASE + 0x84)
/** PPA_RND_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  Reserved.
 */
#define PPA_RND_ECO_HIGH    0xFFFFFFFFU
#define PPA_RND_ECO_HIGH_M  (PPA_RND_ECO_HIGH_V << PPA_RND_ECO_HIGH_S)
#define PPA_RND_ECO_HIGH_V  0xFFFFFFFFU
#define PPA_RND_ECO_HIGH_S  0

/** PPA_ECO_CELL_CTRL_REG register
 *  Reserved.
 */
#define PPA_ECO_CELL_CTRL_REG (DR_REG_PPA_BASE + 0x88)
/** PPA_RDN_RESULT : RO; bitpos: [0]; default: 0;
 *  Reserved.
 */
#define PPA_RDN_RESULT    (BIT(0))
#define PPA_RDN_RESULT_M  (PPA_RDN_RESULT_V << PPA_RDN_RESULT_S)
#define PPA_RDN_RESULT_V  0x00000001U
#define PPA_RDN_RESULT_S  0
/** PPA_RDN_ENA : R/W; bitpos: [1]; default: 0;
 *  Reserved.
 */
#define PPA_RDN_ENA    (BIT(1))
#define PPA_RDN_ENA_M  (PPA_RDN_ENA_V << PPA_RDN_ENA_S)
#define PPA_RDN_ENA_V  0x00000001U
#define PPA_RDN_ENA_S  1

/** PPA_SRAM_CTRL_REG register
 *  PPA SRAM Control Register
 */
#define PPA_SRAM_CTRL_REG (DR_REG_PPA_BASE + 0x8c)
/** PPA_MEM_AUX_CTRL : R/W; bitpos: [13:0]; default: 4896;
 *  Control signals
 */
#define PPA_MEM_AUX_CTRL    0x00003FFFU
#define PPA_MEM_AUX_CTRL_M  (PPA_MEM_AUX_CTRL_V << PPA_MEM_AUX_CTRL_S)
#define PPA_MEM_AUX_CTRL_V  0x00003FFFU
#define PPA_MEM_AUX_CTRL_S  0

/** PPA_DEBUG_CTRL0_REG register
 *  debug register
 */
#define PPA_DEBUG_CTRL0_REG (DR_REG_PPA_BASE + 0x90)
/** PPA_DBG_REPLACE_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures the data replace location. 0: not replace, 1: srm rx input, 2: srm rx
 *  bilin interpolation, 3: srm tx output, 4: blend fg input, 5: blend bg input, 6:
 *  blend output
 */
#define PPA_DBG_REPLACE_SEL    0x00000007U
#define PPA_DBG_REPLACE_SEL_M  (PPA_DBG_REPLACE_SEL_V << PPA_DBG_REPLACE_SEL_S)
#define PPA_DBG_REPLACE_SEL_V  0x00000007U
#define PPA_DBG_REPLACE_SEL_S  0

/** PPA_DEBUG_CTRL1_REG register
 *  debug register
 */
#define PPA_DEBUG_CTRL1_REG (DR_REG_PPA_BASE + 0x94)
/** PPA_DBG_REPLACE_DATA : R/W; bitpos: [31:0]; default: 0;
 *  Configures the replace data
 */
#define PPA_DBG_REPLACE_DATA    0xFFFFFFFFU
#define PPA_DBG_REPLACE_DATA_M  (PPA_DBG_REPLACE_DATA_V << PPA_DBG_REPLACE_DATA_S)
#define PPA_DBG_REPLACE_DATA_V  0xFFFFFFFFU
#define PPA_DBG_REPLACE_DATA_S  0

/** PPA_RGB2GRAY_REG register
 *  rgb2gray register
 */
#define PPA_RGB2GRAY_REG (DR_REG_PPA_BASE + 0x98)
/** PPA_RGB2GRAY_B : R/W; bitpos: [7:0]; default: 85;
 *  Configures the b parameter for rgb2gray
 */
#define PPA_RGB2GRAY_B    0x000000FFU
#define PPA_RGB2GRAY_B_M  (PPA_RGB2GRAY_B_V << PPA_RGB2GRAY_B_S)
#define PPA_RGB2GRAY_B_V  0x000000FFU
#define PPA_RGB2GRAY_B_S  0
/** PPA_RGB2GRAY_G : R/W; bitpos: [15:8]; default: 86;
 *  Configures the g parameter for rgb2gray
 */
#define PPA_RGB2GRAY_G    0x000000FFU
#define PPA_RGB2GRAY_G_M  (PPA_RGB2GRAY_G_V << PPA_RGB2GRAY_G_S)
#define PPA_RGB2GRAY_G_V  0x000000FFU
#define PPA_RGB2GRAY_G_S  8
/** PPA_RGB2GRAY_R : R/W; bitpos: [23:16]; default: 85;
 *  Configures the r parameter for rgb2gray
 */
#define PPA_RGB2GRAY_R    0x000000FFU
#define PPA_RGB2GRAY_R_M  (PPA_RGB2GRAY_R_V << PPA_RGB2GRAY_R_S)
#define PPA_RGB2GRAY_R_V  0x000000FFU
#define PPA_RGB2GRAY_R_S  16

/** PPA_DATE_REG register
 *  PPA Version register
 */
#define PPA_DATE_REG (DR_REG_PPA_BASE + 0x100)
/** PPA_DATE : R/W; bitpos: [31:0]; default: 539234848;
 *  register version.
 */
#define PPA_DATE    0xFFFFFFFFU
#define PPA_DATE_M  (PPA_DATE_V << PPA_DATE_S)
#define PPA_DATE_V  0xFFFFFFFFU
#define PPA_DATE_S  0

#ifdef __cplusplus
}
#endif
